const aartis = {
ganpati: `
श्री गणपतीची आरती

सुखकर्ता दुखहर्ता वार्ता विघ्नाची । 
नुरवी पूर्वी प्रेम कृपा जयाची । 
सर्वांगी सुंदर उटी शेंदुराची | 
कंठी झरके माल मुक्ताफळाची ॥१॥ 

जय देव जय देव जय मंगलमूर्ती । 
दर्शनमात्रे मनकामना पुरती || 

जय देव रत्नखचित फरा तूज गौरीकुमरा । 
चंदनाची उटी कुंकुमकेशरा | 
हिरे जडित मुकुट शोभतो बरा | 
रुणझुणती नुपुरे चरणी घागरिया ॥२॥ 

जय देव लंबोदर पितांबर फनी वरवंदना | 
सरळ सोंड वक्रतुंड त्रिनयना | 
दास रामाचा वाट पाहे सदना | 
संकटी पावावे निर्वाणी रक्षावे सुरवंदना | 
जय देव जय देव जय मंगलमूर्ती । 
दर्शनमात्रे मनकामना पुरती ॥३॥ जय देव

`,

shankar: `
श्री शंकराची आरती

लवथवती विक्राळा ब्रह्मांडी माळा । 
वीषें कंठ काळा त्रिनेत्रीं ज्वाळा ॥ 
लावण्यसुंदर मस्तकीं बाळा । 
तेथुनियां जल निर्मळ वाहे झुळझूळां ॥०१॥

जय देव जय देव जय श्रीशंकरा । 
आरती ओवाळू तुज कर्पूरगौरा ॥ जय देव जय देव

कर्पूरगौरा भोळा नयनीं विशाळा । 
अर्धागीं पार्वती सुमनांच्या माळा ॥ 
विभुतीचें उधळण शितिकंठ नीळा । 
ऐसा शंकर शोभे उमावेल्हाळा ॥०२॥

जय देव जय देव जय श्रीशंकरा । 
आरती ओवाळू तुज कर्पूरगौरा ॥ जय देव जय देव

देवीं दैत्य सागरमंथन पै केलें । 
त्यामाजीं जें अवचित हळाहळ उठिलें ॥ 
तें त्वां असुरपणें प्राशन केलें । 
नीळकंठ नाम प्रसिद्ध झालें ॥०३॥

जय देव जय देव जय श्रीशंकरा । 
आरती ओवाळू तुज कर्पूरगौरा ॥ जय देव जय देव

व्याघ्रांबर फणिवरधर सुंदर मदनारी । 
पंचानन मनमोहन मुनिजनसुखकारी ॥ 
शतकोटीचें बीज वाचे उच्चारी । 
रघुकुळटिळक रामदासा अंतरीं ॥०४॥

जय देव जय देव जय श्रीशंकरा । 
आरती ओवाळू तुज कर्पूरगौरा ॥
`,

durga: `
दुर्गा देवीची आरती ।।

दुर्गे दुर्घट भारी तुजविण संसारी । 
अनाथनाथे अंबे करुणा विस्तारी ।। 
वारी वारी जन्तमरणातें बारीं । 
हारी पडलों आतां संकट निवारी ॥ 

जय देवी जय देवी महिषासुरमधिनी । 
सुरवरईश्वरवरदे तारक संजीवनी ॥ जय० ॥धृ॥ 

तुजविण भुवनी पहाता तुजऐसी नाहीं । 
चारी श्रमले परंतु न बोलवे काहीं ।। 
साही विवाद करितां पडले प्रवाहीं । 
ते तू भक्तालागी पावसि लवलाही ।। जय० ।।धृ।। 

प्रसन्नवदने प्रसन्न होसी निजदासां । 
क्लेशापासूनि सोडीं तोडी भवपाशा ।। 
अंबे तुजवांचून कोण पुरविल आशा । 
नरहरि तल्लिन झाला पदपंकज लेशा ।
`,

datta: `
श्री दत्त आरती

त्रिगुणात्मक त्रैमूर्ती दत्त हा जाणा 
त्रिगुणी अवतार त्रैलोक्य राणा 
नेति नेति शब्द न ये अनुमाना 
सुरवर मुनिजन योगी समाधी न ये ध्याना ॥१॥

सबाह्य अभ्यंतरी तू एक दत्त 
अभाग्यासी कैसी न कळे ही मात 
पराही परतली तेथे कैचा हा हेत 
जन्म मरणाचा पुरलासे अंत ॥२॥

दत्त येऊनिया उभा ठाकला 
भावे साष्टांगेसी प्रणिपात केला 
प्रसन्न होउनी आशीर्वाद दिधला 
जन्ममरणाचा फेरा चुकविला ॥३॥

दत्त दत्त ऐसे लागले ध्यान 
हरपले मन झाले उन्मन 
मी तू पणाची झाली बोळवण 
एका जनार्दनी श्रीदत्त ध्यान ॥४॥
`,
  
vitthal: `
श्री विठ्ठल आरती

युगे अठ्ठावीस विटेवरी उभा वामाङ्गी रखुमाईदिसे दिव्य शोभा । 
पुण्डलिकाचे भेटि परब्रह्म आले गा चरणी वाहे भीमा उद्धरी जगा ॥१॥

जय देव जय देव जय पाण्डुरङ्गा । 
रखुमाई वल्लभा राईच्या वल्लभा पावे जिवलगा ॥ धृ०॥

तुळसीमाळा गळा कर ठेऊनी कटी कासे पीताम्बर कस्तुरी लल्लाटी । 
देव सुरवर नित्य येती भेटी गरुड हनुमन्त पुढे उभे राहती ॥२॥

धन्य वेणूनाद अणुक्षेत्रपाळा सुवर्णाची कमळे वनमाळा गळा । 
राई रखुमाबाई राणीया सकळा ओवाळिती राजा विठोबा सावळा ॥३॥

ओवाळू आरत्या कुरवण्ड्या येती चन्द्रभागेमाजी सोडुनिया देती । 
दिण्ड्या पताका वैष्णव नाचती पण्ढरीचा महिमा वर्णावा किती ॥४॥

आषाढी कार्तिकी भक्तजन येती चन्द्रभागेमाजी स्नाने जे करिती । 
दर्शन होळामात्रे तया होय मुक्ति केशवासी नामदेव भावे ओवाळिती ॥५॥
`
};
