const aartis = {
ganpati: `
सुखकर्ता दुःखहर्ता वार्ता विघ्नाची
नुरवी पुरवी प्रेम कृपा जयाची
सर्वांगी सुंदर उटी शेंदुराची
कंठी झळके माळ मुक्ताफळांची

जय देव जय देव जय मंगलमूर्ती
दर्शनमात्रे मनःकामना पूर्ती
`,

shankar: `
लवथवती विक्राळा ब्रह्मांडी माळा
वीषे कंठ काळा त्रिनेत्री ज्वाळा
लावण्यसुंदर मस्तकी बाळा
तेथुनिया जल निर्मळ वाहे झुळझुळा

जय देव जय देव जय श्रीशंकरा
आरती ओवाळू तुज कर्पूरगौरा
`,

vitthal: `
युगे अठ्ठावीस विटेवरी उभा
वामांगी रखुमाई दिसे दिव्य शोभा
पुंडलिकाचे भेटी परब्रह्म आले
चरणी वाहे भीमा उद्धरी जगे

जय देव जय देव जय पांडुरंगा
रखुमाई वल्लभा राईच्या संग
`
};
