const damodarstotra = 
`
|| दामोदर स्तोत्र ||

करारविन्देन पदारविन्दं मुखारविन्दे विनिवेशयन्तम्,
वटस्य पत्रस्य पुटे शयानं बालं मुकुन्दं मनसा स्मरामि,

श्रीकृष्ण गोविन्द हरे मुरारे हे नाथ नारायण वासुदेव,
जिव्हे पिबस्वामृतमेतदेव गोविन्द दामोदर माधवेति,

विक्रेतुकामा किल गोपकन्या मुरारिपादार्पितचित्तवृत्ति:,
दध्यादिकं मोहवशादवोचद् गोविन्द दामोदर माधवेति,

गृहे गृहे गोपवधूकदम्बा: सर्वे मिलित्वा समवाप्य योगम्,
पुण्यानि नामानि पठन्ति नित्यं गोविन्द दामोदर माधवेति,

सुखं शयाना निलये निजेऽपि नामानि विष्णो: प्रवदन्ति मर्त्या,
ते निश्चितं तन्मयतां व्रजन्ति गोविन्द दामोदर माधवेति,

जिव्हे सदैवं भज सुन्दराणि नामानि कृष्णस्य मनोहराणि,
समस्त भक्तार्ति विनाशनानि गोविन्द दामोदर माधवेति,

सुखावसाने इदमेव सारं दु:खावसाने इदमेव ज्ञेयम्,
देहावसाने इदमेव जाप्यं गोविन्द दामोदर माधवेति,

श्रीकृष्ण राधावर गोकुलेश गोपाल गोवर्धन नाथ विष्णुः,
जिव्हे पिबस्वा मृतमेतदेव गोविंद दामोदर माधवेति,

जिव्हे रसज्ञे मधुर प्रिया त्वं सत्यं हितं त्वां परमं वदामि,
अवर्णयेथा मधुराक्षराणि गोविन्द दामोदर माधवेति,

त्वामेव याचे मम देहि जिह्वे समागते दण्डधरे कृतान्ते,
वक्तव्यमेवं मधुरं सुभक्त्या गोविन्द दामोदर माधवेति,

श्रीनाथ विश्वेश्वर विश्व मूर्ते श्री देवकी नंदन दैत्य शत्रु ,
जिव्हे पिबस्वामृतमेतेव गोविंद दामोदर माधवेति ,

गोपी पते कंसरिपो मुकुंद लक्ष्मी पते केशव वासुदेव
जिव्हे पिबस्वामृतमेतेव गोविंद दामोदर माधवेति||
`;
