const hanumanChalisa = `
॥ दोहा ॥

श्रीगुरु चरन सरोज रज निज मनु मुकुरु सुधारि ।
बरनउँ रघुबर बिमल जसु जो दायकु फल चारि ॥

बुद्धिहीन तनु जानिके सुमिरौं पवन-कुमार ।
बल बुधि बिद्या देहु मोहिं हरहु कलेस बिकार ॥

॥ चौपाई ॥


जय हनुमान ज्ञान गुन सागर ।
जय कपीस तिहुँ लोक उजागर ॥०१॥

राम दूत अतुलित बल धामा ।
अंजनी-पुत्र पवनसुत नामा ॥०२॥

महाबीर बिक्रम बजरंगी ।
कुमति निवार सुमति के संगी ॥०३॥

कंचन बरन बिराज सुबेसा ।
कानन कुण्डल कुंचित केसा ॥०४॥

हाथ बज्र और ध्वजा बिराजै ।
काँधे मूँज जनेऊ साजै ॥०५॥

संकर सुवन केसरी नंदन ।
तेज प्रताप महा जग बन्दन ॥०६॥

बिद्यावान गुनी अति चातुर ।
राम काज करिबे को आतुर ॥०७॥

प्रभु चरित्र सुनिबे को रसिया ।
राम लखन सीता मन बसिया ॥०८॥

सूक्ष्म रूप धरि सियहिं दिखावा ।
बिकट रूप धरि लंक जरावा ॥०९॥

भीम रूप धरि असुर सँहारे ।
रामचन्द्र के काज सँवारे ॥१०॥

लाय संजीवन लखन जियाये ।
श्रीरघुबीर हरषि उर लाये ॥११॥

रघुपति किन्ही बहुत बड़ाई ।
तुम मम प्रिय भरतहि सम भाई ॥१२॥

सहस बदन तुम्हरो जस गावैं ।
अस कहि श्रीपति कंठ लगावैं ॥१३॥

सनकादिक ब्रम्हादि मुनीसा ।
नारद सारद सहित अहीसा ॥१४॥

जम कुबेर दिगपाल जहाँ ते ।
कबि कोबिद कहि सके कहाँ ते ॥१५॥

तुम उपकार सुग्रीवहिं कीन्हा ।
राम मिलाय राज पद दीन्हा ॥१६॥

तुम्हरो मंत्र बिभीषन माना ।
लंकेस्वर भए सब जग जाना ॥१७॥

जुग सहस्त्र जोजन पर भानु ।
लील्यो ताहि मधुर फल जानू ॥१८॥

प्रभु मुद्रिका मेलि मुख माहीं ।
जलधि लाँघि गये अचरज नाहीं ॥१९॥

दुर्गम काज जगत के जेते ।
सुगम अनुग्रह तुम्हरे तेते ॥२०॥

राम दुआरे तुम रखवारे ।
होत न आज्ञा बिनु पैसारे ॥२१॥

सब सुख लहै तुम्हारी सरना ।
तुम रच्छक काहू को डर ना ॥२२॥

आपन तेज सम्हारो आपै ।
तीनों लोक हाँक तें काँपै ॥२३॥

भूत पिसाच निकट नहिं आवै ।
महाबीर जब नाम सुनावै ॥२४॥

नासै रोग हरै सब पीरा ।
जपत निरन्तर हनुमत बीरा ॥२५॥

संकट तें हनुमान छुडावे ।
मन क्रम बचन ध्यान जो लावै ॥२६॥

सब पर राम तपस्वी राजा ।
तिन के काज सकल तुम साजा ॥२७॥

और मनोरथ जो कोई लावै ।
सोहि अमित जीवन फल पावै ॥२८॥

चारो जुग परताप तुम्हारा ।
है परसिद्ध जगत उजियारा ॥२९॥

साधु सन्त के तुम रखवारे ।
असुर निकन्दन राम दुलारे ॥३०॥

अष्टसिद्धि नौ निधि के दाता ।
अस बर दीन जानकी माता ॥३१॥

राम रसायन तुम्हरे पासा ।
सदा रहो रघुपति के दासा ॥३२॥

तुम्हरे भजन राम को पावै ।
जनम जनम के दुख बिसरावै ॥३३॥

अन्त काल रघुबर पुर जाई ।
जहाँ जन्म हरिभक्त कहाई ॥३४॥

और देवता चित्त न धरई ।
हनुमत सेही सर्ब सुख करई ॥३५॥

संकट कटै मिटै सब पीरा ।
जो सुमिरे हनुमत बलबीरा ॥३६॥

जय जय जय हनुमान गोसाईं ।
कृपा करहु गुरुदेव की नाईं ॥३७॥

जो सत बार पाठ कर कोई ।
छूटहि बन्दि महा सुख होई ॥३८॥

जो यह पढ़ै हनुमान चालीसा ।
होय सिद्धि साखी गौरीसा ॥३९॥

तुलसीदास सदा हरि चेरा ।
कीजै नाथ हृदय मह डेरा ॥४०॥

॥ दोहा ॥
पवनतनय संकट हरन मंगल मुर्ति रूप ।
राम लखन सीता सहित हृदय बसहु सुर भूप ॥


॥ जय-घोष ॥
बोल बजरंगबली की जय ।
पवन पुत्र हनुमान की जय ॥

`;
