const shivtandavstotram = 
`
॥ सार्थशिवताण्डवस्तोत्रम् ॥

जटा टवी गलज्जलप्रवाह पावितस्थले 
गलेऽव लम्ब्यलम्बितां भुजंगतुंग मालिकाम्‌।
डमड्डमड्डमड्डमन्निनाद वड्डमर्वयं 
चकारचण्डताण्डवं तनोतु नः शिव: शिवम्‌ ॥१॥

जटाकटा हसंभ्रम भ्रमन्निलिंपनिर्झरी 
विलोलवीचिवल्लरी विराजमानमूर्धनि।
धगद्धगद्धगज्ज्वल ल्ललाटपट्टपावके 
किशोरचंद्रशेखरे रतिः प्रतिक्षणं मम: ॥२॥

धराधरेंद्रनंदिनी विलासबन्धुबन्धुर 
स्फुरद्दिगंतसंतति प्रमोद मानमानसे।
कृपाकटाक्षधोरणी निरुद्धदुर्धरापदि 
क्वचिद्विगम्बरे मनोविनोदमेतु वस्तुनि ॥३॥

जटाभुजंगपिंगल स्फुरत्फणामणिप्रभा 
कदंबकुंकुमद्रव प्रलिप्तदिग्व धूमुखे।
मदांधसिंधु रस्फुरत्वगुत्तरीयमेदुरे 
मनोविनोदद्भुतं बिंभर्तुभूत भर्तरि ॥४॥

सहस्रलोचन प्रभृत्यशेषलेखशेखर 
प्रसूनधूलिधोरणी विधूसरां घ्रिपीठभूः।
भुजंगराजमालया निबद्धजाटजूटकः 
श्रियैचिरायजायतां चकोरबंधुशेखरः ॥५॥

ललाटचत्वरज्वल द्धनंजयस्फुलिंगभा निपीतपंच सायकंनम न्निलिंपनायकम्‌।
सुधामयूखलेखया विराजमानशेखरं महाकपालिसंपदे शिरोजटालमस्तुनः ॥६॥

करालभालपट्टिका धगद्धगद्धगज्ज्वल 
द्धनंजया धरीकृतप्रचंड पंचसायके।
धराधरेंद्रनंदिनी कुचाग्रचित्रपत्र 
कप्रकल्पनैकशिल्पिनी त्रिलोचनेरतिर्मम ॥७॥

नवीनमेघमंडली निरुद्धदुर्धरस्फुर 
त्कुहुनिशीथनीतमः प्रबद्धबद्धकन्धरः।
निलिम्पनिर्झरीधरस्तनोतु कृत्तिसिंधुरः 
कलानिधानबंधुरः श्रियं जगंद्धुरंधरः ॥८॥

प्रफुल्लनीलपंकज प्रपंचकालिमप्रभा 
विडंबि कंठकंध रारुचि प्रबंधकंधरम्‌।
स्मरच्छिदं पुरच्छिंद भवच्छिदं मखच्छिदं 
गजच्छिदांधकच्छिदं तमंतकच्छिदं भजे ॥९॥

अखर्वसर्वमंगला कलाकदम्बमंजरी 
रसप्रवाह माधुरी विजृंभणा मधुव्रतम्‌।
स्मरांतकं पुरातकं भावंतकं मखांतकं 
गजांतकांधकांतकं तमंतकांतकं भजे ॥१०॥

जयत्वदभ्रविभ्रम भ्रमद्भुजंगमस्फुरद्ध 
गद्धगद्विनिर्गमत्कराल भाल हव्यवाट्।
धिमिद्धिमिद्धि मिध्वनन्मृदंग तुंगमंगल
ध्वनिक्रमप्रवर्तित: प्रचण्ड ताण्डवः शिवः ॥११॥

दृषद्विचित्रतल्पयो र्भुजंगमौक्तिकमस्र 
जोर्गरिष्ठरत्नलोष्ठयोः सुहृद्विपक्षपक्षयोः।
तृणारविंदचक्षुषोः प्रजामहीमहेन्द्रयोः 
समं प्रवर्तयन्मनः कदा सदाशिवं भजे ॥१२॥

कदा निलिंपनिर्झरी निकुंजकोटरे वसन्‌ 
विमुक्तदुर्मतिः सदा शिरःस्थमंजलिं वहन्‌।
विमुक्तलोललोचनो ललामभाललग्नकः 
शिवेति मंत्रमुच्चरन्‌ कदा सुखी भवाम्यहम्‌ ॥१३॥

निलिम्प नाथनागरी कदम्ब मौलमल्लिका-
निगुम्फनिर्भक्षरन्म धूष्णिकामनोहरः।
तनोतुनो मनोमुदं विनोदिनींमहनिशं 
परिश्रय परं पदं तदंगजत्विषां चयः ॥१४॥

प्रचण्ड वाडवानल प्रभाशुभप्रचारणी 
महाष्टसिद्धिकामिनी जनावहूत जल्पना।
विमुक्त वाम लोचनो विवाहकालिकध्वनिः 
शिवेति मन्त्रभूषगो जगज्जयाय जायताम्‌ ॥१५॥

इमं ही नित्यमेव मुक्तमुक्तमोत्तम
स्तवं पठन्स्मरन्‌ ब्रुवन्नरो विशुद्धमेति संततम्‌।
हरे गुरौ सुभक्तिमाशु याति नान्यथागतिं 
विमोहनं ही देहिनांं सुशंकरस्य चिंतनम् ॥१६॥

पूजाऽवसानसमये दशवक्रत्रगीतं 
यः शम्भूपूजनपरम् पठति प्रदोषे।
तस्य स्थिरां रथगजेंद्रतुरंगयुक्तां 
लक्ष्मी सदैव सुमुखीं प्रददाति शम्भुः ॥१७॥

॥ इति रावणकृतं शिव ताण्डवस्तोत्रं सम्पूर्णम् ॥
`;
