
const vishnusahasranaam = `

॥ श्री विष्णु सहस्त्रनाम स्तोत्रम ॥

ॐ नमो भगवते वासुदेवाय नम:
 
ॐ विश्वं विष्णु: वषट्कारो भूत-भव्य-भवत-प्रभुः ।
भूत-कृत भूत-भृत भावो भूतात्मा भूतभावनः ।। 1 ।।
 
पूतात्मा परमात्मा च मुक्तानां परमं गतिः।
अव्ययः पुरुष साक्षी क्षेत्रज्ञो अक्षर एव च ।। 2 ।।
 
योगो योग-विदां नेता प्रधान-पुरुषेश्वरः ।
नारसिंह-वपुः श्रीमान केशवः पुरुषोत्तमः ।। 3 ।।

सर्वः शर्वः शिवः स्थाणु: भूतादि: निधि: अव्ययः ।
संभवो भावनो भर्ता प्रभवः प्रभु: ईश्वरः ।। 4 ।।
 
स्वयंभूः शम्भु: आदित्यः पुष्कराक्षो महास्वनः ।
अनादि-निधनो धाता विधाता धातुरुत्तमः ।। 5 ।।
 
अप्रमेयो हृषीकेशः पद्मनाभो-अमरप्रभुः ।
विश्वकर्मा मनुस्त्वष्टा स्थविष्ठः स्थविरो ध्रुवः ।। 6 ।।

अग्राह्यः शाश्वतः कृष्णो लोहिताक्षः प्रतर्दनः ।
प्रभूतः त्रिककुब-धाम पवित्रं मंगलं परं ।। 7।।
 
ईशानः प्राणदः प्राणो ज्येष्ठः श्रेष्ठः प्रजापतिः ।
हिरण्य-गर्भो भू-गर्भो माधवो मधुसूदनः ।। 8 ।।
 
ईश्वरो विक्रमी धन्वी मेधावी विक्रमः क्रमः ।
अनुत्तमो दुराधर्षः कृतज्ञः कृति: आत्मवान ।। 9 ।।

सुरेशः शरणं शर्म विश्व-रेताः प्रजा-भवः ।
अहः संवत्सरो व्यालः प्रत्ययः सर्वदर्शनः ।। 10 ।।
 
अजः सर्वेश्वरः सिद्धः सिद्धिः सर्वादि: अच्युतः ।
वृषाकपि: अमेयात्मा सर्व-योग-विनिःसृतः ।। 11 ।।
 
वसु:वसुमनाः सत्यः समात्मा संमितः समः ।
अमोघः पुण्डरीकाक्षो वृषकर्मा वृषाकृतिः ।। 12 ।।

रुद्रो बहु-शिरा बभ्रु: विश्वयोनिः शुचि-श्रवाः ।
अमृतः शाश्वतः स्थाणु: वरारोहो महातपाः ।। 13 ।।
 
सर्वगः सर्वविद्-भानु:विष्वक-सेनो जनार्दनः ।
वेदो वेदविद-अव्यंगो वेदांगो वेदवित् कविः ।। 14 ।।
 
लोकाध्यक्षः सुराध्यक्षो धर्माध्यक्षः कृता-कृतः ।
चतुरात्मा चतुर्व्यूह:-चतुर्दंष्ट्र:-चतुर्भुजः ।। 15 ।।

भ्राजिष्णु भोजनं भोक्ता सहिष्णु: जगदादिजः ।
अनघो विजयो जेता विश्वयोनिः पुनर्वसुः ।। 16 ।।
 
उपेंद्रो वामनः प्रांशु: अमोघः शुचि: ऊर्जितः ।
अतींद्रः संग्रहः सर्गो धृतात्मा नियमो यमः ।। 17 ।।
 
वेद्यो वैद्यः सदायोगी वीरहा माधवो मधुः।
अति-इंद्रियो महामायो महोत्साहो महाबलः ।। 18 ।।

महाबुद्धि: महा-वीर्यो महा-शक्ति: महा-द्युतिः।
अनिर्देश्य-वपुः श्रीमान अमेयात्मा महाद्रि-धृक ।। 19 ।।
 
महेष्वासो महीभर्ता श्रीनिवासः सतां गतिः ।
अनिरुद्धः सुरानंदो गोविंदो गोविदां-पतिः ।। 20 ।।
 
मरीचि:दमनो हंसः सुपर्णो भुजगोत्तमः ।
हिरण्यनाभः सुतपाः पद्मनाभः प्रजापतिः ।। 21 ।।

अमृत्युः सर्व-दृक् सिंहः सन-धाता संधिमान स्थिरः ।
अजो दुर्मर्षणः शास्ता विश्रुतात्मा सुरारिहा ।। 22 ।।
 
गुरुःगुरुतमो धामः सत्यः सत्य-पराक्रमः ।
निमिषो-अ-निमिषः स्रग्वी वाचस्पति: उदार-धीः ।। 23 ।।
 
अग्रणी: ग्रामणीः श्रीमान न्यायो नेता समीरणः ।
सहस्र-मूर्धा विश्वात्मा सहस्राक्षः सहस्रपात ।। 24 ।।

आवर्तनो निवृत्तात्मा संवृतः सं-प्रमर्दनः ।
अहः संवर्तको वह्निः अनिलो धरणीधरः ।। 25 ।।
 
सुप्रसादः प्रसन्नात्मा विश्वधृक्-विश्वभुक्-विभुः ।
सत्कर्ता सकृतः साधु: जह्नु:-नारायणो नरः ।। 26 ।।
 
असंख्येयो-अप्रमेयात्मा विशिष्टः शिष्ट-कृत्-शुचिः ।
सिद्धार्थः सिद्धसंकल्पः सिद्धिदः सिद्धिसाधनः ।। 27।।

वृषाही वृषभो विष्णु: वृषपर्वा वृषोदरः ।
वर्धनो वर्धमानश्च विविक्तः श्रुति-सागरः ।। 28 ।।
 
सुभुजो दुर्धरो वाग्मी महेंद्रो वसुदो वसुः ।
नैक-रूपो बृहद-रूपः शिपिविष्टः प्रकाशनः ।। 29 ।।
 
ओज: तेजो-द्युतिधरः प्रकाश-आत्मा प्रतापनः ।
ऋद्धः स्पष्टाक्षरो मंत्र:चंद्रांशु: भास्कर-द्युतिः ।। 30 ।।

अमृतांशूद्भवो भानुः शशबिंदुः सुरेश्वरः ।
औषधं जगतः सेतुः सत्य-धर्म-पराक्रमः ।। 31 ।।
 
भूत-भव्य-भवत्-नाथः पवनः पावनो-अनलः ।
कामहा कामकृत-कांतः कामः कामप्रदः प्रभुः ।। 32 ।।
 
युगादि-कृत युगावर्तो नैकमायो महाशनः ।
अदृश्यो व्यक्तरूपश्च सहस्रजित्-अनंतजित ।। 33 ।।

इष्टो विशिष्टः शिष्टेष्टः शिखंडी नहुषो वृषः ।
क्रोधहा क्रोधकृत कर्ता विश्वबाहु: महीधरः ।। 34 ।।
 
अच्युतः प्रथितः प्राणः प्राणदो वासवानुजः ।
अपाम निधिरधिष्टानम् अप्रमत्तः प्रतिष्ठितः ।। 35 ।।
 
स्कन्दः स्कन्द-धरो धुर्यो वरदो वायुवाहनः ।
वासुदेवो बृहद भानु: आदिदेवः पुरंदरः ।। 36 ।।

अशोक: तारण: तारः शूरः शौरि: जनेश्वर: ।
अनुकूलः शतावर्तः पद्मी पद्मनिभेक्षणः ।। 37 ।।
 
पद्मनाभो-अरविंदाक्षः पद्मगर्भः शरीरभृत ।
महर्धि-ऋद्धो वृद्धात्मा महाक्षो गरुड़ध्वजः ।। 38 ।।
 
अतुलः शरभो भीमः समयज्ञो हविर्हरिः ।
सर्वलक्षण लक्षण्यो लक्ष्मीवान समितिंजयः ।। 39 ।।

विक्षरो रोहितो मार्गो हेतु: दामोदरः सहः ।
महीधरो महाभागो वेगवान-अमिताशनः ।। 40 ।।
 
उद्भवः क्षोभणो देवः श्रीगर्भः परमेश्वरः ।
करणं कारणं कर्ता विकर्ता गहनो गुहः ।। 41 ।।
 
व्यवसायो व्यवस्थानः संस्थानः स्थानदो-ध्रुवः ।
परर्रद्वि परमस्पष्टः तुष्टः पुष्टः शुभेक्षणः ।। 42 ।।

रामो विरामो विरजो मार्गो नेयो नयो-अनयः ।
वीरः शक्तिमतां श्रेष्ठ: धर्मो धर्मविदुत्तमः ।। 43 ।।
 
वैकुंठः पुरुषः प्राणः प्राणदः प्रणवः पृथुः ।
हिरण्यगर्भः शत्रुघ्नो व्याप्तो वायुरधोक्षजः ।। 44।।
 
ऋतुः सुदर्शनः कालः परमेष्ठी परिग्रहः ।
उग्रः संवत्सरो दक्षो विश्रामो विश्व-दक्षिणः ।। 45 ।।

विस्तारः स्थावर: स्थाणुः प्रमाणं बीजमव्ययम ।
अर्थो अनर्थो महाकोशो महाभोगो महाधनः ।। 46 ।।
 
अनिर्विण्णः स्थविष्ठो-अभूर्धर्म-यूपो महा-मखः ।
नक्षत्रनेमि: नक्षत्री क्षमः क्षामः समीहनः ।। 47 ।।
 
यज्ञ इज्यो महेज्यश्च क्रतुः सत्रं सतां गतिः ।
सर्वदर्शी विमुक्तात्मा सर्वज्ञो ज्ञानमुत्तमं ।। 48 ।।

सुव्रतः सुमुखः सूक्ष्मः सुघोषः सुखदः सुहृत ।
मनोहरो जित-क्रोधो वीरबाहुर्विदारणः ।। 49 ।।
 
स्वापनः स्ववशो व्यापी नैकात्मा नैककर्मकृत ।
वत्सरो वत्सलो वत्सी रत्नगर्भो धनेश्वरः ।। 50 ।।
 
धर्मगुब धर्मकृद धर्मी सदसत्क्षरं-अक्षरं ।
अविज्ञाता सहस्त्रांशु: विधाता कृतलक्षणः ।। 51 ।।

गभस्तिनेमिः सत्त्वस्थः सिंहो भूतमहेश्वरः ।
आदिदेवो महादेवो देवेशो देवभृद गुरुः ।। 52 ।।
 
उत्तरो गोपतिर्गोप्ता ज्ञानगम्यः पुरातनः ।
शरीर भूतभृद्भोक्ता कपींद्रो भूरिदक्षिणः ।। 53 ।।
 
सोमपो-अमृतपः सोमः पुरुजित पुरुसत्तमः ।
विनयो जयः सत्यसंधो दाशार्हः सात्वतां पतिः ।। 54 ।।

जीवो विनयिता-साक्षी मुकुंदो-अमितविक्रमः ।
अम्भोनिधिरनंतात्मा महोदधिशयो-अंतकः ।। 55 ।।
 
अजो महार्हः स्वाभाव्यो जितामित्रः प्रमोदनः ।
आनंदो नंदनो नंदः सत्यधर्मा त्रिविक्रमः ।। 56 ।।
 
महर्षिः कपिलाचार्यः कृतज्ञो मेदिनीपतिः ।
त्रिपदस्त्रिदशाध्यक्षो महाश्रृंगः कृतांतकृत ।। 57 ।।

महावराहो गोविंदः सुषेणः कनकांगदी ।
गुह्यो गंभीरो गहनो गुप्तश्चक्र-गदाधरः ।। 58 ।।
 
वेधाः स्वांगोऽजितः कृष्णो दृढः संकर्षणो-अच्युतः ।
वरूणो वारुणो वृक्षः पुष्कराक्षो महामनाः ।। 59 ।।
 
भगवान भगहानंदी वनमाली हलायुधः ।
आदित्यो ज्योतिरादित्यः सहिष्णु:-गतिसत्तमः ।। 60 ।।

सुधन्वा खण्डपरशुर्दारुणो द्रविणप्रदः ।
दिवि:स्पृक् सर्वदृक व्यासो वाचस्पति:अयोनिजः ।। 61 ।।
 
त्रिसामा सामगः साम निर्वाणं भेषजं भिषक ।
संन्यासकृत्-छमः शांतो निष्ठा शांतिः परायणम ।। 62 ।।
 
शुभांगः शांतिदः स्रष्टा कुमुदः कुवलेशयः ।
गोहितो गोपतिर्गोप्ता वृषभाक्षो वृषप्रियः ।। 63 ।।

अनिवर्ती निवृत्तात्मा संक्षेप्ता क्षेमकृत्-शिवः ।
श्रीवत्सवक्षाः श्रीवासः श्रीपतिः श्रीमतां वरः ।। 64 ।।
 
श्रीदः श्रीशः श्रीनिवासः श्रीनिधिः श्रीविभावनः ।
श्रीधरः श्रीकरः श्रेयः श्रीमान्-लोकत्रयाश्रयः ।। 65 ।।
 
स्वक्षः स्वंगः शतानंदो नंदिर्ज्योतिर्गणेश्वर: ।
विजितात्मा विधेयात्मा सत्कीर्तिश्छिन्नसंशयः ।। 66 ।।

उदीर्णः सर्वत:चक्षुरनीशः शाश्वतस्थिरः ।
भूशयो भूषणो भूतिर्विशोकः शोकनाशनः ।। 67 ।।
 
अर्चिष्मानर्चितः कुंभो विशुद्धात्मा विशोधनः ।
अनिरुद्धोऽप्रतिरथः प्रद्युम्नोऽमितविक्रमः ।। 68 ।।
 
कालनेमिनिहा वीरः शौरिः शूरजनेश्वरः ।
त्रिलोकात्मा त्रिलोकेशः केशवः केशिहा हरिः ।। 69 ।।

कामदेवः कामपालः कामी कांतः कृतागमः ।
अनिर्देश्यवपुर्विष्णु: वीरोअनंतो धनंजयः ।। 70 ।।
 
ब्रह्मण्यो ब्रह्मकृत् ब्रह्मा ब्रह्म ब्रह्मविवर्धनः ।
ब्रह्मविद ब्राह्मणो ब्रह्मी ब्रह्मज्ञो ब्राह्मणप्रियः ।। 71 ।।
 
महाक्रमो महाकर्मा महातेजा महोरगः ।
महाक्रतुर्महायज्वा महायज्ञो महाहविः ।। 72 ।।

स्तव्यः स्तवप्रियः स्तोत्रं स्तुतिः स्तोता रणप्रियः ।
पूर्णः पूरयिता पुण्यः पुण्यकीर्तिरनामयः ।। 73 ।।
 
मनोजवस्तीर्थकरो वसुरेता वसुप्रदः ।
वसुप्रदो वासुदेवो वसुर्वसुमना हविः ।। 74 ।।
 
सद्गतिः सकृतिः सत्ता सद्भूतिः सत्परायणः ।
शूरसेनो यदुश्रेष्ठः सन्निवासः सुयामुनः ।। 75 ।।

भूतावासो वासुदेवः सर्वासुनिलयो-अनलः ।
दर्पहा दर्पदो दृप्तो दुर्धरो-अथापराजितः ।। 76 ।।
 
विश्वमूर्तिमहार्मूर्ति:दीप्तमूर्ति: अमूर्तिमान ।
अनेकमूर्तिरव्यक्तः शतमूर्तिः शताननः ।। 77 ।।
 
एको नैकः सवः कः किं यत-तत-पद्मनुत्तमम ।
लोकबंधु: लोकनाथो माधवो भक्तवत्सलः ।। 78 ।।

सुवर्णोवर्णो हेमांगो वरांग: चंदनांगदी ।
वीरहा विषमः शून्यो घृताशीरऽचलश्चलः ।। 79 ।।
 
अमानी मानदो मान्यो लोकस्वामी त्रिलोकधृक ।
सुमेधा मेधजो धन्यः सत्यमेधा धराधरः ।। 80 ।।
 
तेजोवृषो द्युतिधरः सर्वशस्त्रभृतां वरः ।
प्रग्रहो निग्रहो व्यग्रो नैकश्रृंगो गदाग्रजः ।। 81 ।।

चतुर्मूर्ति: चतुर्बाहु:श्चतुर्व्यूह:चतुर्गतिः ।
चतुरात्मा चतुर्भाव:चतुर्वेदविदेकपात ।। 82 ।।
 
समावर्तो-अनिवृत्तात्मा दुर्जयो दुरतिक्रमः ।
दुर्लभो दुर्गमो दुर्गो दुरावासो दुरारिहा ।। 83 ।।
 
शुभांगो लोकसारंगः सुतंतुस्तंतुवर्धनः ।
इंद्रकर्मा महाकर्मा कृतकर्मा कृतागमः ।। 84 ।।

उद्भवः सुंदरः सुंदो रत्ननाभः सुलोचनः ।
अर्को वाजसनः श्रृंगी जयंतः सर्वविज-जयी ।। 85 ।।
 
सुवर्णबिंदुरक्षोभ्यः सर्ववागीश्वरेश्वरः ।
महाह्रदो महागर्तो महाभूतो महानिधः ।। 86 ।।
 
कुमुदः कुंदरः कुंदः पर्जन्यः पावनो-अनिलः ।
अमृतांशो-अमृतवपुः सर्वज्ञः सर्वतोमुखः ।। 87 ।।

सुलभः सुव्रतः सिद्धः शत्रुजिच्छत्रुतापनः ।
न्यग्रोधो औदुंबरो-अश्वत्थ:चाणूरांध्रनिषूदनः ।। 88 ।।
 
सहस्रार्चिः सप्तजिव्हः सप्तैधाः सप्तवाहनः ।
अमूर्तिरनघो-अचिंत्यो भयकृत्-भयनाशनः ।। 89 ।।
 
अणु:बृहत कृशः स्थूलो गुणभृन्निर्गुणो महान् ।
अधृतः स्वधृतः स्वास्यः प्राग्वंशो वंशवर्धनः ।। 90 ।।

भारभृत्-कथितो योगी योगीशः सर्वकामदः ।
आश्रमः श्रमणः क्षामः सुपर्णो वायुवाहनः ।। 91 ।।
 
धनुर्धरो धनुर्वेदो दंडो दमयिता दमः ।
अपराजितः सर्वसहो नियंता नियमो यमः ।। 92 ।।
 
सत्त्ववान सात्त्विकः सत्यः सत्यधर्मपरायणः ।
अभिप्रायः प्रियार्हो-अर्हः प्रियकृत-प्रीतिवर्धनः ।। 93 ।।

विहायसगतिर्ज्योतिः सुरुचिर्हुतभुग विभुः ।
रविर्विरोचनः सूर्यः सविता रविलोचनः ।। 94 ।।
 
अनंतो हुतभुग्भोक्ता सुखदो नैकजोऽग्रजः ।
अनिर्विण्णः सदामर्षी लोकधिष्ठानमद्भुतः ।। 95।।
 
सनात्-सनातनतमः कपिलः कपिरव्ययः ।
स्वस्तिदः स्वस्तिकृत स्वस्ति स्वस्तिभुक स्वस्तिदक्षिणः ।। 96 ।।

अरौद्रः कुंडली चक्री विक्रम्यूर्जितशासनः ।
शब्दातिगः शब्दसहः शिशिरः शर्वरीकरः ।। 97 ।।
 
अक्रूरः पेशलो दक्षो दक्षिणः क्षमिणां वरः ।
विद्वत्तमो वीतभयः पुण्यश्रवणकीर्तनः ।। 98 ।।
 
उत्तारणो दुष्कृतिहा पुण्यो दुःस्वप्ननाशनः ।
वीरहा रक्षणः संतो जीवनः पर्यवस्थितः ।। 99 ।।

अनंतरूपो-अनंतश्री: जितमन्यु: भयापहः ।
चतुरश्रो गंभीरात्मा विदिशो व्यादिशो दिशः ।। 100 ।।
 
अनादिर्भूर्भुवो लक्ष्मी: सुवीरो रुचिरांगदः ।
जननो जनजन्मादि: भीमो भीमपराक्रमः ।। 101 ।।

आधारनिलयो-धाता पुष्पहासः प्रजागरः ।
ऊर्ध्वगः सत्पथाचारः प्राणदः प्रणवः पणः ।। 102 ।।
 
प्रमाणं प्राणनिलयः प्राणभृत प्राणजीवनः ।
तत्त्वं तत्त्वविदेकात्मा जन्ममृत्यु जरातिगः ।। 103 ।।
 
भूर्भवः स्वस्तरुस्तारः सविता प्रपितामहः ।
यज्ञो यज्ञपतिर्यज्वा यज्ञांगो यज्ञवाहनः ।। 104 ।।

यज्ञभृत्-यज्ञकृत्-यज्ञी यज्ञभुक्-यज्ञसाधनः ।
यज्ञान्तकृत-यज्ञगुह्यमन्नमन्नाद एव च ।। 105 ।।
 
आत्मयोनिः स्वयंजातो वैखानः सामगायनः ।
देवकीनंदनः स्रष्टा क्षितीशः पापनाशनः ।। 106 ।।
 
शंखभृन्नंदकी चक्री शार्ङ्गधन्वा गदाधरः ।
रथांगपाणिरक्षोभ्यः सर्वप्रहरणायुधः ।। 107 ।।

सर्वप्रहरणायुध ॐ नमः इति।
 
वनमालि गदी शार्ङ्गी शंखी चक्री च नंदकी ।
श्रीमान् नारायणो विष्णु: वासुदेवोअभिरक्षतु । इति।

`;
